#include <stdio.h>
#include <stdlib.h>
#include <time.h>

void limparBuffer() {
    int c;
    while ((c = getchar()) != '\n' && c != EOF) {}
}


int jogo() {
    int espadas[10] = {0}; // 0 = seguro, 1 = bomba
    int fatal, escolha;
    int turnos[2] ={1,2};
    int turno_atual=0;

    srand(time(NULL)); // inicia o RNG

    // Sorteia a posição fatal
    fatal = rand() % 10; 
    espadas[fatal] = 1;

    printf("=== PULA PIRATA ===\n");
    printf(
"⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣿⣿⡿⠿⢛⣛⣋⣉⠉⠉⠉⠉⠉⠉⠉⠙⠛⠛⠿⢿⣿⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣿⡟⠛⠻⠶⣶⣦⣤⣤⣤⣤⣤⣤⣤⣤⣴⣶⠶⠟⠛⢻⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣿⠇⠀⠀⢸⡏⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⢹⡇⠀⠀⠸⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⡿⠷⠶⢶⣾⣧⣤⣄⣀⣀⣸⣇⣀⣀⣠⣤⣬⣿⡶⠶⠿⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣷⣤⣤⣀⣀⣀⡈⠉⠉⠉⠉⠉⠉⠉⠉⠁⣀⣀⣀⣤⣤⣾⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⠋⠀⠈⢹⡿⠙⠛⠛⠛⠛⢻⡟⠛⠛⠛⠛⠋⢹⡏⠁⠀⠙⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⡄⠀⠀⢸⡇⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⡇⠀⠀⢸⣿⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⢸⡇⠀⠀⢠⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣿⠷⢶⣤⣿⣤⣀⣀⣀⣀⣸⣇⣀⣀⣀⣀⣠⣿⣧⣶⠶⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣿⣆⣀⠀⠀⠉⠉⠉⠉⠙⠛⠛⠛⠉⠉⠉⠉⠁⠀⢀⣀⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣿⣯⠙⠛⢻⡷⠶⠶⣶⣦⣤⣤⣤⣶⡶⠶⢶⡿⠛⠛⣽⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣿⣿⣷⣦⣼⣷⣀⣀⣀⣀⣸⣇⣀⣀⣀⣀⣾⣧⣴⣾⣿⣿⣿⣿⣿⣿\n"
"⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n"
    );

    while (1) {
        if (turnos[turno_atual]==1)
        {
            printf("\nJOGADOR 1:");
        }else{
            printf("\nJOGADOR 2:");
        }
        printf("\nEscolha um numero de 1 a 10: ");
        scanf("%d", &escolha);


        // Ajusta para índice do array (0 a 9)
        escolha--;

        // Verifica entrada válida
        if (escolha < 0 || escolha > 9) {
            printf("Opcao invalida!\n");
            limparBuffer();
            continue;
        }

        // Verifica se caiu na posição fatal
        if (espadas[escolha] == 1) {
            printf("💥 BOOOM! O pirata voou! Voce perdeu!\n");
            break;
        } else {
            printf("Tudo seguro... por enquanto\n");
            turno_atual++;
            if (turno_atual==2){
                turno_atual=0;
            }
        }
    }
    return 0;

}




int main() {
    int jogar;

    do {
        jogo();

        printf("\nQuer jogar de novo? 1 = SIM - 0 = NÃO ");
        scanf("%d", &jogar);

    } while (jogar == 1);

    printf("Até mais! \n");
    return 0;
    }
